Revit 2027 API
IExternalResourceServer.AreSameResources Method
 Implement this method to indicate whether two given resources are the same.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
bool AreSameResources(
	IDictionary<string, string> reference1,
	IDictionary<string, string> reference2
)
Function AreSameResources (
	reference1 As IDictionary(Of String, String),
	reference2 As IDictionary(Of String, String)
) As Boolean
bool AreSameResources(
	IDictionary<String^, String^>^ reference1,
	IDictionary<String^, String^>^ reference2
)
abstract AreSameResources :
        reference1 : IDictionary<string, string> *
        reference2 : IDictionary<string, string> -> bool
Parameters
reference1 IDictionary<String, String>
reference2 IDictionary<String, String>
Return Value
Boolean
 True if two given resources are the same; otherwise false.
See Also
Reference
IExternalResourceServer Interface
Autodesk.Revit.DB Namespace